app/controllers/demos_controller.rb

    def create
       employee = Employee.find_by(ssn: params[:demo][:ssn])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."ssn" = ? LIMIT ?  [["ssn", "081014488"], ["LIMIT", 1]]