app/controllers/demos_controller.rb

    def create
       employee = Employee.find_by(phone: params[:demo][:phone])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."phone" = ? LIMIT ?  [["phone", "3943318484"], ["LIMIT", 1]]