app/controllers/employees_controller.rb

INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "phone" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["phone", "1234567891"], ["updated_at", "2019-04-01 19:13:41.773595"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)